In [2]:
%load_ext sql

In [3]:
%sql sqlite:///prueba.db

In [4]:
%%sql
SELECT name
FROM sqlite_master
WHERE type= "table"

 * sqlite:///prueba.db
Done.

[('cats',), ('cats_restricted',), ('cats_deafault',)]

In [5]:
%%sql 
CREATE TABLE cats(
name VARCHAR(50),
age INT
);

 * sqlite:///prueba.db
(sqlite3.OperationalError) table cats already exists
[SQL: CREATE TABLE cats(
name VARCHAR(50),
age INT
);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [6]:
%%sql
SELECT name
FROM sqlite_master
WHERE type = "table";

 * sqlite:///prueba.db
Done.

[('cats',), ('cats_restricted',), ('cats_deafault',)]

In [7]:
%sql PRAGMA table_info(cats)

 * sqlite:///prueba.db
Done.

[(0, 'name', 'VARCHAR(50)', 0, None, 0), (1, 'age', 'INT', 0, None, 0)]

#### **Inserta datos en la tabla** ####

In [8]:
%%sql 
INSERT INTO cats(name,age)
VALUES ("bolita", 2);

 * sqlite:///prueba.db
1 rows affected.

[]

#### **Tomar toda la tabla** ####

In [9]:
%sql SELECT * FROM cats

 * sqlite:///prueba.db
Done.

[('bolita', 2),
 ('bolita', 2),
 ('oreo', 3),
 ('pocoyo', 4),
 ('leon', 5),
 ('tobias', None),
 (None, None),
 ("vandido\\'s", 3),
 ("vandido's", 3),
 ('bolita', 2)]

#### **Insertar Datos Multiples** ####

In [10]:
%%sql
INSERT INTO cats(name,age)
VALUES
("oreo",3),
("pocoyo",4),
("leon",5);

 * sqlite:///prueba.db
3 rows affected.

[]

In [11]:
%sql SELECT * FROM cats

 * sqlite:///prueba.db
Done.

[('bolita', 2),
 ('bolita', 2),
 ('oreo', 3),
 ('pocoyo', 4),
 ('leon', 5),
 ('tobias', None),
 (None, None),
 ("vandido\\'s", 3),
 ("vandido's", 3),
 ('bolita', 2),
 ('oreo', 3),
 ('pocoyo', 4),
 ('leon', 5)]

In [12]:
%sql PRAGMA table_info(cats)

 * sqlite:///prueba.db
Done.

[(0, 'name', 'VARCHAR(50)', 0, None, 0), (1, 'age', 'INT', 0, None, 0)]

#### **Valores NULL** ####
- Nos permite decir si una parte de la tabla puede tener NULLS

In [13]:
%%sql 
INSERT INTO cats (name,age)
VALUES ("tobias", NULL);

 * sqlite:///prueba.db
1 rows affected.

[]

In [14]:
%sql SELECT * FROM cats;

 * sqlite:///prueba.db
Done.

[('bolita', 2),
 ('bolita', 2),
 ('oreo', 3),
 ('pocoyo', 4),
 ('leon', 5),
 ('tobias', None),
 (None, None),
 ("vandido\\'s", 3),
 ("vandido's", 3),
 ('bolita', 2),
 ('oreo', 3),
 ('pocoyo', 4),
 ('leon', 5),
 ('tobias', None)]

In [15]:

%%sql
INSERT INTO cats (name, age)
VALUES (NULL, NULL);

 * sqlite:///prueba.db
1 rows affected.

[]

In [16]:
%sql SELECT * FROM cats;

 * sqlite:///prueba.db
Done.

[('bolita', 2),
 ('bolita', 2),
 ('oreo', 3),
 ('pocoyo', 4),
 ('leon', 5),
 ('tobias', None),
 (None, None),
 ("vandido\\'s", 3),
 ("vandido's", 3),
 ('bolita', 2),
 ('oreo', 3),
 ('pocoyo', 4),
 ('leon', 5),
 ('tobias', None),
 (None, None)]

In [17]:
%%sql

CREATE TABLE cats_restricted (
    name VARCHAR(50) NOT NULL,
    age INT NOT NULL
);

 * sqlite:///prueba.db
(sqlite3.OperationalError) table cats_restricted already exists
[SQL: CREATE TABLE cats_restricted (
    name VARCHAR(50) NOT NULL,
    age INT NOT NULL
);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [18]:
%%sql
SELECT name
FROM sqlite_master
WHERE type="table";

 * sqlite:///prueba.db
Done.

[('cats',), ('cats_restricted',), ('cats_deafault',)]

In [19]:
%sql PRAGMA table_info(cats_restricted)

 * sqlite:///prueba.db
Done.

[(0, 'name', 'VARCHAR(50)', 1, None, 0), (1, 'age', 'INT', 1, None, 0)]

#### **Insertando simbolos especiales** ####

In [20]:
%%sql
INSERT INTO cats (name, age)
VALUES ('vandido''s',3);

 * sqlite:///prueba.db
1 rows affected.

[]

In [21]:
%sql SELECT * FROM cats;

 * sqlite:///prueba.db
Done.

[('bolita', 2),
 ('bolita', 2),
 ('oreo', 3),
 ('pocoyo', 4),
 ('leon', 5),
 ('tobias', None),
 (None, None),
 ("vandido\\'s", 3),
 ("vandido's", 3),
 ('bolita', 2),
 ('oreo', 3),
 ('pocoyo', 4),
 ('leon', 5),
 ('tobias', None),
 (None, None),
 ("vandido's", 3)]

#### **DEFAULT VALUES** ####

In [22]:
%%sql 
CREATE TABLE cats_deafault(
    name VARCHAR(50) DEFAULT "gato",
    age INT DEFAULT 0
)

 * sqlite:///prueba.db
(sqlite3.OperationalError) table cats_deafault already exists
[SQL: CREATE TABLE cats_deafault(
    name VARCHAR(50) DEFAULT "gato",
    age INT DEFAULT 0
)]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [23]:
%%sql
SELECT name
FROM sqlite_master
WHERE type="table";

 * sqlite:///prueba.db
Done.

[('cats',), ('cats_restricted',), ('cats_deafault',)]

In [24]:
%sql PRAGMA table_info(cats_default);

 * sqlite:///prueba.db
Done.

[]

In [25]:
%%sql
INSERT INTO cats_deafault (name,age)
VALUES (NULL, NULL);

 * sqlite:///prueba.db
1 rows affected.

[]

In [26]:
%sql SELECT * from cats_deafault

 * sqlite:///prueba.db
Done.

[(None, None), (None, None), (None, None)]

In [27]:
%%sql
INSERT INTO cats_deafault ()
VALUES ();

 * sqlite:///prueba.db
(sqlite3.OperationalError) near ")": syntax error
[SQL: INSERT INTO cats_deafault ()
VALUES ();]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

#### **PRIMARY KEYS** ####

In [28]:
%%sql
CREATE TABLE cats_key(
    catid INT NOT NULL PRIMARY KEY,
    name VARCHAR(50),
    age INT
)

 * sqlite:///prueba.db
Done.

[]

In [29]:
%%sql
SELECT name
FROM sqlite_master
WHERE type="table"

 * sqlite:///prueba.db
Done.

[('cats',), ('cats_restricted',), ('cats_deafault',), ('cats_key',)]

In [30]:
%sql PRAGMA table_info(cats_key)

 * sqlite:///prueba.db
Done.

[(0, 'catid', 'INT', 1, None, 1),
 (1, 'name', 'VARCHAR(50)', 0, None, 0),
 (2, 'age', 'INT', 0, None, 0)]

#### **AUTOINCREMENTO** ####


```sql
CREATE TABLE cats_autoincrement(
    cat_id INT AUTO_INCREMENT,
    name VARCHAR(50),
    age INT
);